# GraphicsStyleId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidOptions..::..GraphicsStyleId Property
SolidOptions Class See Also
---
Defines the graphics style id for the Solid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId GraphicsStyleId { get; set; }
```

Visual Basic
---
```text
Public Property GraphicsStyleId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ GraphicsStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
SolidOptions Class
Autodesk.Revit.DB Namespace